---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.OutsideDiameter
source: html/9c5ebee8-b43f-856b-ee74-3c029f9a9975.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.OutsideDiameter Property

The outside diameter of the pipe. Units: (ft).

## Syntax (C#)
```csharp
public double OutsideDiameter { get; }
```